	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("РеквизитСтатьяЗатрат", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"), 
		"Объект.РасшифровкаПлатежа", "Статья затрат");
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Вставить("РеквизитСтатьяЗатрат", Тип("ПолеФормы"), Элементы.РасшифровкаПлатежа, Элементы.РасшифровкаПлатежаОтступ);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.РасшифровкаПлатежа.фд_СтатьяЗатрат"; 
