Если РольДоступна("фд_ДобавлениеИзменениеСправочникПодразделенияОрганизаций") Тогда
		
		ЕстьДопРоль = Ложь;
		ДопРольДоступна = Новый Соответствие;
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.Местоположение, РольДоступна("фд_ДобавлениеПодразделенийМестоположение"));
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.фд_МВДир, РольДоступна("фд_ДобавлениеПодразделенийМВДиР"));	
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.фд_ФЦП, РольДоступна("фд_ДобавлениеПодразделенийФЦП"));
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.фд_КПМИ, РольДоступна("фд_ДобавлениеПодразделенийКПМИ"));
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.Прочее, РольДоступна("фд_ДобавлениеПодразделенийПрочее"));
		ДопРольДоступна.Вставить(Перечисления.фд_ВидМВДиР.Управление, РольДоступна("фд_ДобавлениеПодразделенийУправление"));
		
		Для каждого Элемент Из ДопРольДоступна Цикл
			Если Элемент.Значение = Истина Тогда
				ЕстьДопРоль = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопРоль Тогда
			
			Если НЕ ДопРольДоступна.Получить(фд_ВидМВДиР) Тогда
				
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно прав для записи объекта с данным видом";
				Сообщение.Сообщить();

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
