Функция СформироватьОтчет()	Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда	
		ОбластьШапка.Параметры.НачалоПериода = Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.КонецПериода = Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
    Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Запрос.УстановитьПараметр("Организация", фд_РаботаСПредопределеннымиПризнакамиВызовСервера.ПолучитьЭлементПоПризнаку("РОСМОРПОРТФГУП"));
	Запрос.УстановитьПараметр("Контрагент", фд_РаботаСПредопределеннымиПризнакамиВызовСервера.ПолучитьЭлементПоПризнаку("ФАМРТ"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК СсылкаДоговор,
		|	ОсновныеСредства.Ссылка КАК СсылкаОС,
		|	фд_ОбъектыЗИО.Ссылка КАК СсылкаЗИО,
		|	ОсновныеСредства.Код КАК КодОС,
		|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
		|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
		|	фд_ОбъектыЗИО.КадастровыйНомер КАК КадастровыйНомер,
		|	фд_ОбъектыЗИО.Площадь КАК Площадь,
		|	фд_ОбъектыЗИО.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	фд_ОбъектыЗИО.ГодоваяАренднаяПлата КАК ГодоваяАренднаяПлата,
		|	фд_ОбъектыЗИО.ПериодичностьАП КАК Периодичность,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Договоры_ЗИО_ОС
		|ИЗ
		|	Справочник.фд_ОбъектыЗИО КАК фд_ОбъектыЗИО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО фд_ОбъектыЗИО.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
		|		ПО фд_ОбъектыЗИО.ОсновноеСредство = ОсновныеСредства.Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентов.Организация В ИЕРАРХИИ(&Организация)
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.СрокДействия >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.ДоговорКонтрагента.Ссылка КАК ДоговорСсылка,
		|	СписаниеСРасчетногоСчета.Дата КАК ДатаСписания,
		|	СписаниеСРасчетногоСчета.Номер КАК НомерСписания,
		|	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаСписания,
		|	СписаниеСРасчетногоСчета.Ссылка КАК СсылкаСписание
		|ИЗ
		|	ВТ_Договоры_ЗИО_ОС КАК ВТ_Договоры_ЗИО_ОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = СписаниеСРасчетногоСчета.ДоговорКонтрагента.Ссылка
		|ГДЕ
		|	ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = СписаниеСРасчетногоСчета.ДоговорКонтрагента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеПенейЗадолженность.Ссылка.ДоговорКонтрагента.Ссылка КАК ДоговорСсылка,
		|	НачислениеПенейЗадолженность.Ссылка КАК СсылкаПени,
		|	НачислениеПенейЗадолженность.Сумма КАК СуммаПеней,
		|	НачислениеПенейЗадолженность.Просрочка КАК ПросрочкаПеней
		|ИЗ
		|	ВТ_Договоры_ЗИО_ОС КАК ВТ_Договоры_ЗИО_ОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПеней.Задолженность КАК НачислениеПенейЗадолженность
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = НачислениеПенейЗадолженность.Ссылка.ДоговорКонтрагента.Ссылка
		|ГДЕ
		|	ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = НачислениеПенейЗадолженность.Ссылка.ДоговорКонтрагента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручение.ДоговорКонтрагента.Ссылка КАК ДоговорСсылка,
		|	ПлатежноеПоручение.Ссылка КАК СсылкаПоручение,
		|	ПлатежноеПоручение.Дата КАК ДатаПоручения,
		|	ПлатежноеПоручение.Номер КАК НомерПоручения
		|ИЗ
		|	ВТ_Договоры_ЗИО_ОС КАК ВТ_Договоры_ЗИО_ОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ПлатежноеПоручение.ДоговорКонтрагента.Ссылка
		|ГДЕ
		|	ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ПлатежноеПоручение.ДоговорКонтрагента.Ссылка";

		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаСписание = МассивРезультатов[1].Выбрать();
		ВыборкаПени = МассивРезультатов[2].Выбрать();
		ВыборкаПоручение = МассивРезультатов[3].Выбрать();
		
		ТЗСписание = Новый ТаблицаЗначений();
		ТЗСписание.Колонки.Добавить("ДоговорСсылка", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		ТЗСписание.Колонки.Добавить("ДатаСписания", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТЗСписание.Колонки.Добавить("НомерСписания", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТЗСписание.Колонки.Добавить("СуммаСписания", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТЗСписание.Колонки.Добавить("СуммаВсехСписаний", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
		ТЗСписание.Колонки.Добавить("КварталСписания", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		
		Пока ВыборкаСписание.СледующийПоЗначениюПоля("ДоговорСсылка") Цикл
			НоваяСтрока = ТЗСписание.Добавить();
			НоваяСтрока.ДоговорСсылка = ВыборкаСписание.ДоговорСсылка;
			Пока ВыборкаСписание.Следующий() Цикл 
				НоваяСтрока.ДатаСписания = НоваяСтрока.ДатаСписания + Формат(ВыборкаСписание.ДатаСписания, "ДЛФ=D") + "; ";
				НоваяСтрока.НомерСписания = НоваяСтрока.НомерСписания + ВыборкаСписание.НомерСписания + "; ";
				НоваяСтрока.СуммаСписания = НоваяСтрока.СуммаСписания + ВыборкаСписание.СуммаСписания + "; ";
				НоваяСтрока.СуммаВсехСписаний = НоваяСтрока.СуммаВсехСписаний + ВыборкаСписание.СуммаСписания;
				НоваяСтрока.КварталСписания = НоваяСтрока.КварталСписания + Формат(НачалоКвартала(ВыборкаСписание.ДатаСписания),"ДФ='кк ""квартал""") + "; ";
			КонецЦикла;
		КонецЦикла;
		
		ТЗПени = Новый ТаблицаЗначений();
		ТЗПени.Колонки.Добавить("ДоговорСсылка", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		ТЗПени.Колонки.Добавить("СуммаПеней", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТЗПени.Колонки.Добавить("ПросрочкаПеней", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		
		Пока ВыборкаПени.СледующийПоЗначениюПоля("ДоговорСсылка") Цикл
			НоваяСтрока = ТЗПени.Добавить();
			НоваяСтрока.ДоговорСсылка = ВыборкаПени.ДоговорСсылка;
			Пока ВыборкаПени.Следующий() Цикл 
				НоваяСтрока.СуммаПеней = НоваяСтрока.СуммаПеней + ВыборкаПени.СуммаПеней + "; ";
				НоваяСтрока.ПросрочкаПеней = НоваяСтрока.ПросрочкаПеней + ВыборкаПени.ПросрочкаПеней + "; ";
			КонецЦикла;
		КонецЦикла;
		
		ТЗПоручение = Новый ТаблицаЗначений();
		ТЗПоручение.Колонки.Добавить("ДоговорСсылка", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		ТЗПоручение.Колонки.Добавить("ДатаПоручения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		ТЗПоручение.Колонки.Добавить("НомерПоручения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		
		Пока ВыборкаПоручение.СледующийПоЗначениюПоля("ДоговорСсылка") Цикл
			НоваяСтрока = ТЗПоручение.Добавить();
			НоваяСтрока.ДоговорСсылка = ВыборкаПоручение.ДоговорСсылка;
			Пока ВыборкаПоручение.Следующий() Цикл 
				НоваяСтрока.ДатаПоручения = НоваяСтрока.ДатаПоручения + Формат(ВыборкаПоручение.ДатаПоручения, "ДЛФ=D") + "; ";
				НоваяСтрока.НомерПоручения = НоваяСтрока.НомерПоручения + ВыборкаПоручение.НомерПоручения + "; ";
			КонецЦикла;
		КонецЦикла;		
	
		Запрос1 = Новый Запрос;
		Запрос1.МенеджерВременныхТаблиц = МВТ;
		Запрос1.УстановитьПараметр("ТЗСписание", ТЗСписание);
		Запрос1.УстановитьПараметр("ТЗПени", ТЗПени);
		Запрос1.УстановитьПараметр("ТЗПоручение", ТЗПоручение);
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	ТЗСписание.ДоговорСсылка КАК ДоговорСсылка,
		|	ТЗСписание.ДатаСписания КАК ДатаСписания,
		|	ТЗСписание.НомерСписания КАК НомерСписания,
		|	ТЗСписание.СуммаСписания КАК СуммаСписания,
		|	ТЗСписание.СуммаВсехСписаний КАК СуммаВсехСписаний,
		|	ТЗСписание.КварталСписания КАК КварталСписания
		|ПОМЕСТИТЬ ТЗСписание
		|ИЗ
		|	&ТЗСписание КАК ТЗСписание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗПени.ДоговорСсылка КАК ДоговорСсылка,
		|	ТЗПени.СуммаПеней КАК СуммаПеней,
		|	ТЗПени.ПросрочкаПеней КАК ПросрочкаПеней
		|ПОМЕСТИТЬ ТЗПени
		|ИЗ
		|	&ТЗПени КАК ТЗПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗПоручение.ДоговорСсылка КАК ДоговорСсылка,
		|	ТЗПоручение.ДатаПоручения КАК ДатаПоручения,
		|	ТЗПоручение.НомерПоручения КАК НомерПоручения
		|ПОМЕСТИТЬ ТЗПоручение
		|ИЗ
		|	&ТЗПоручение КАК ТЗПоручение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры_ЗИО_ОС.СсылкаДоговор КАК СсылкаДоговор,
		|	ВТ_Договоры_ЗИО_ОС.СсылкаОС КАК СсылкаОС,
		|	ВТ_Договоры_ЗИО_ОС.НомерДоговора КАК НомерДоговора,
		|	ВТ_Договоры_ЗИО_ОС.КодОС КАК КодОС,
		|	ВТ_Договоры_ЗИО_ОС.ДатаДоговора КАК ДатаДоговора,
		|	ВТ_Договоры_ЗИО_ОС.КадастровыйНомер КАК КадастровыйНомер,
		|	ОсновныеСредстваКонтактнаяИнформация.Представление КАК Адрес,
		|	ВТ_Договоры_ЗИО_ОС.Площадь КАК Площадь,
		|	ВТ_Договоры_ЗИО_ОС.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВТ_Договоры_ЗИО_ОС.ГодоваяАренднаяПлата КАК ГодоваяАренднаяПлата,
		|	ВТ_Договоры_ЗИО_ОС.Периодичность КАК Периодичность,
		|	ТЗСписание.ДатаСписания КАК ДатаСписания,
		|	ТЗСписание.НомерСписания КАК НомерСписания,
		|	ТЗСписание.СуммаСписания КАК СуммаСписания,
		|	ТЗСписание.КварталСписания КАК КварталСписания,
		|	ТЗСписание.СуммаВсехСписаний КАК СуммаВсехСписаний,
		|	ТЗПени.СуммаПеней КАК СуммаПеней,
		|	ТЗПени.ПросрочкаПеней КАК ПросрочкаПеней,
		|	ТЗПоручение.ДатаПоручения КАК ДатаПоручения,
		|	ТЗПоручение.НомерПоручения КАК НомерПоручения,
		|	ВТ_Договоры_ЗИО_ОС.Организация КАК Организация,
		|	ВерсияСоглашенияКоммерческийДоговор.фд_Примечание КАК Примечание,
		|	ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияИндексации.фд_ДатаИндексации КАК ДатаИндексации,
		|	ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияИндексации.фд_НомерУведомления КАК НомерИндексации,
		|	ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияИндексации.фд_ПроцентИндексации КАК ПроцентИндексации,
		|	ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияСтоимости.ДатаИзменения КАК ДатаИзмененияКС,
		|	ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияСтоимости.фд_НомерУвед КАК НомерИзмененияКС
		|ИЗ
		|	ВТ_Договоры_ЗИО_ОС КАК ВТ_Договоры_ЗИО_ОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор.фд_ИзмененияИндексации КАК ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияИндексации
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияИндексации.Ссылка.ДоговорКонтрагента.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор.фд_ИзмененияСтоимости КАК ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияСтоимости
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ВерсияСоглашенияКоммерческийДоговорфд_ИзмененияСтоимости.Ссылка.ДоговорКонтрагента.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаОС = ОсновныеСредстваКонтактнаяИнформация.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗСписание КАК ТЗСписание
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ТЗСписание.ДоговорСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗПени КАК ТЗПени
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ТЗПени.ДоговорСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗПоручение КАК ТЗПоручение
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ТЗПоручение.ДоговорСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
		|		ПО ВТ_Договоры_ЗИО_ОС.СсылкаДоговор = ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента.Ссылка";	
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	ВыборкаДокументы1 = РезультатЗапроса1.Выбрать();
	
	ТекущаяСтрока = 0;
	
	Пока ВыборкаДокументы1.Следующий() Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДокументы1);
		ОбластьСтрока.Параметры.НомерСтроки = ТекущаяСтрока;
		ОбластьСтрока.Параметры.ДатаДоговора = Формат(ВыборкаДокументы1.ДатаСписания, "ДЛФ=D");
		ОбластьСтрока.Параметры.ДатаИндексации = Формат(ВыборкаДокументы1.ДатаИндексации, "ДЛФ=D");
		ОбластьСтрока.Параметры.ДатаИзмененияКС = Формат(ВыборкаДокументы1.ДатаИзмененияКС, "ДЛФ=D");
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
